/*
  2015.8.19 15:43
  求斐波那契数列的任意一项的值！                           


*/
#include <stdio.h>
int main()
{
	int n, i;
	int f1, f2, f3;
	
	f2 = 2;
	f1 = 1;
	printf ("请输入您想要的数列的序列数：");
	scanf ("%d", &n);
	
	if (n == 1)
	{
	    f3 = 1;
        printf ("该项为:%d\n", f3); 	
	}
	else if (n == 2)
	{
	    f3 = 1;
        printf ("该项为：%d\n", f3);	
	}
	else if (n >= 3)
	{
		for (i = 3; i <= n; i++)
		     {
		     	f3 = f1 + f2;
		     	f1 = f2;               
		     	f2 = f3;   //保证了每次在下次循环时数列中n+1项的前两项（第n项和第n-1项已经被求出来）,即f1与f2的值一直被更新 
		     }
	    printf("该项为：%d\n", f3);		
	}    
	else 
	    printf("您的输入有误,请纠正后再次输入\n");
		
	return 0;			
}
/*

  如果能够开发为Windows系统的应用程序就好了，灰常讨厌黑窗口（破控制台程序），还有如何为自己开发的程序（已编译完成的）加上自制
图标，这样我就可以慢慢开发伪装的木马程序了。  
*/ 

